#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_vpc.this: Refreshing state... [id=vpc-06df2cc9df903fcc6]
data.aws_ami.ubuntu: Reading...
aws_security_group.lb: Refreshing state... [id=sg-037b90281f52abe57]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:targetgroup/LB-TG/aaecb7a7f8475f95]
aws_subnet.this["pvt_a"]: Refreshing state... [id=subnet-06d96f236868b790f]
aws_subnet.this["pvt_b"]: Refreshing state... [id=subnet-0d516a0aaf968bf38]
aws_route_table.private: Refreshing state... [id=rtb-0295fb19985f8eb0b]
aws_internet_gateway.this: Refreshing state... [id=igw-05b4a7cf02a48404b]
aws_subnet.this["pub_a"]: Refreshing state... [id=subnet-0d092a9a14b589095]
aws_subnet.this["pub_b"]: Refreshing state... [id=subnet-0bdf6ddd56da2b1ed]
aws_security_group.autoscaling: Refreshing state... [id=sg-0215fd45a294a6139]
aws_route_table.public: Refreshing state... [id=rtb-0fc0b88897e417bf7]
aws_security_group.web: Refreshing state... [id=sg-0f064d81dbde1886a]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:loadbalancer/app/terraform-lb/07bf5e1378873bb0]
aws_route_table_association.this["Public A"]: Refreshing state... [id=rtbassoc-0627b3903173fa941]
aws_route_table_association.this["Public B"]: Refreshing state... [id=rtbassoc-003dde1084be03e03]
aws_route_table_association.this["Private A"]: Refreshing state... [id=rtbassoc-091e916326cbad7cd]
aws_route_table_association.this["Private B"]: Refreshing state... [id=rtbassoc-059505839012e14c4]
aws_security_group.db: Refreshing state... [id=sg-0745ae104adc22303]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:428654095624:listener/app/terraform-lb/07bf5e1378873bb0/db08ad376b73244d]
data.aws_ami.ubuntu: Read complete after 3s [id=ami-0b98832e47b2f19c8]
aws_launch_template.this: Refreshing state... [id=lt-06f25d61bdae6af8e]
aws_autoscaling_group.this: Refreshing state... [id=terraform-autoscaling]
aws_autoscaling_policy.scaledown: Refreshing state... [id=Scale Down]
aws_autoscaling_policy.scaleup: Refreshing state... [id=Scale Up]
aws_cloudwatch_metric_alarm.down: Refreshing state... [id=ASG Down]
aws_cloudwatch_metric_alarm.up: Refreshing state... [id=ASG Up]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.web will be created
  + resource "aws_db_instance" "web" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = "us-east-1a"
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "foo"
      + vpc_security_group_ids                = [
          + "sg-0745ae104adc22303",
        ]
    }

  # aws_db_subnet_group.default will be created
  + resource "aws_db_subnet_group" "default" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "main"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-06d96f236868b790f",
          + "subnet-0d516a0aaf968bf38",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "DB subnet group"
          + "Project"   = "CI/CD-Metabase"
          + "Service"   = "APP"
        }
      + tags_all                = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "DB subnet group"
          + "Project"   = "CI/CD-Metabase"
          + "Service"   = "APP"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_instance.metabase will be created
  + resource "aws_instance" "metabase" {
      + ami                                  = "ami-0b98832e47b2f19c8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0d516a0aaf968bf38"
      + tags                                 = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Metabase Machine"
          + "Project"   = "CI/CD-Metabase"
          + "Service"   = "APP"
        }
      + tags_all                             = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Metabase Machine"
          + "Project"   = "CI/CD-Metabase"
          + "Service"   = "APP"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.metabase will be created
  + resource "aws_security_group" "metabase" {
      + arn                    = (known after apply)
      + description            = "Allow incoming connections to Metabase machine"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0f064d81dbde1886a",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "Metabase"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Metabase Machine"
          + "Project"   = "CI/CD-Metabase"
          + "Service"   = "APP"
        }
      + tags_all               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Metabase Machine"
          + "Project"   = "CI/CD-Metabase"
          + "Service"   = "APP"
        }
      + vpc_id                 = "vpc-06df2cc9df903fcc6"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @vanessafso, Action: `pull_request`*